; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v9)
             (pred_6 ?v7 ?v13)
             (pred_10 ?v10 ?v13)
             (pred_11 ?v12 ?v10 )
	     (pred_3 ?v10)
             (pred_12 ?v2)
             (pred_5 ?v7)
             (pred_1 ?v13)
             (pred_9 ?v10)
             (pred_8 ?v7)
             (pred_2 ?v10)
             (pred_4 ))



(:action op_1
:parameters (?v4 ?v6 ?v8 ?v3)
:precondition (and (pred_12 ?v4) (pred_12 ?v6) (pred_5 ?v8) (pred_1 ?v3)
          (pred_7 ?v4 ?v6) (pred_6 ?v8 ?v3)
                   (pred_10 ?v6 ?v3) (pred_3 ?v4) 
                   (pred_9 ?v6) (pred_8 ?v8))
:effect (and  (pred_2 ?v6) (not (pred_9 ?v6))))


(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_12 ?v4) (pred_12 ?v5)
               (pred_3 ?v4) (pred_7 ?v4 ?v5) (pred_2 ?v5))
:effect (and (pred_3 ?v5) (not (pred_3 ?v4))))

(:action op_4
:parameters (?v4 ?v8)
:precondition (and (pred_12 ?v4) (pred_5 ?v8) 
                  (pred_3 ?v4) (pred_11 ?v8 ?v4) (pred_4 ))
:effect (and (pred_8 ?v8)
   (not (pred_11 ?v8 ?v4)) (not (pred_4 ))))


(:action op_5
:parameters (?v4 ?v1 ?v11)
:precondition (and (pred_12 ?v4) (pred_5 ?v1) (pred_5 ?v11)
                  (pred_3 ?v4) (pred_8 ?v11) (pred_11 ?v1 ?v4))
:effect (and (pred_8 ?v1) (pred_11 ?v11 ?v4)
        (not (pred_8 ?v11)) (not (pred_11 ?v1 ?v4))))

(:action op_3
:parameters (?v4 ?v8)
:precondition (and (pred_12 ?v4) (pred_5 ?v8) 
                  (pred_3 ?v4) (pred_8 ?v8))
:effect (and (pred_4 ) (pred_11 ?v8 ?v4) (not (pred_8 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_31 obj_26 obj_25 obj_30 obj_09 obj_20 obj_23 obj_11 obj_12 obj_27 obj_18 obj_16 obj_28 obj_17 obj_13 obj_02 obj_32 obj_10 obj_15 obj_06 obj_08 obj_03 obj_04 obj_19
    obj_14 obj_01 obj_24
    obj_29 obj_05 obj_07 obj_21
    )

    (:init
       (pred_4)

       (pred_12 obj_22)
       (pred_12 obj_31)
       (pred_12 obj_26)
       (pred_12 obj_25)
       (pred_12 obj_30)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_23)
       (pred_12 obj_11)
       (pred_12 obj_12)
       (pred_12 obj_27)
       (pred_12 obj_18)
       (pred_12 obj_16)
       (pred_12 obj_28)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_32)
       (pred_12 obj_10)
       (pred_12 obj_15)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_12 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_01)
       (pred_1 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_05)
       (pred_5 obj_07)
       (pred_5 obj_21)

       (pred_7 obj_22 obj_09)
       (pred_7 obj_22 obj_31)
       (pred_7 obj_31 obj_20)
       (pred_7 obj_31 obj_26)
       (pred_7 obj_31 obj_22)
       (pred_7 obj_26 obj_23)
       (pred_7 obj_26 obj_25)
       (pred_7 obj_26 obj_31)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_30)
       (pred_7 obj_25 obj_26)
       (pred_7 obj_30 obj_12)
       (pred_7 obj_30 obj_25)
       (pred_7 obj_09 obj_27)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_22)
       (pred_7 obj_20 obj_18)
       (pred_7 obj_20 obj_23)
       (pred_7 obj_20 obj_31)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_23 obj_11)
       (pred_7 obj_23 obj_26)
       (pred_7 obj_23 obj_20)
       (pred_7 obj_11 obj_28)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_23)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_30)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_27 obj_13)
       (pred_7 obj_27 obj_18)
       (pred_7 obj_27 obj_09)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_18 obj_27)
       (pred_7 obj_16 obj_32)
       (pred_7 obj_16 obj_28)
       (pred_7 obj_16 obj_23)
       (pred_7 obj_16 obj_18)
       (pred_7 obj_28 obj_10)
       (pred_7 obj_28 obj_17)
       (pred_7 obj_28 obj_11)
       (pred_7 obj_28 obj_16)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_28)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_13 obj_27)
       (pred_7 obj_02 obj_08)
       (pred_7 obj_02 obj_32)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_32 obj_03)
       (pred_7 obj_32 obj_10)
       (pred_7 obj_32 obj_16)
       (pred_7 obj_32 obj_02)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_28)
       (pred_7 obj_10 obj_32)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_08 obj_02)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_32)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_19 obj_04)
       (pred_9 obj_26)
       (pred_9 obj_22)
       (pred_9 obj_27)
       (pred_9 obj_09)
       (pred_10  obj_26 obj_14)
       (pred_10  obj_22 obj_01)
       (pred_10  obj_27 obj_24)
       (pred_10  obj_09 obj_24)
       (pred_2 obj_31)
       (pred_2 obj_25)
       (pred_2 obj_30)
       (pred_2 obj_20)
       (pred_2 obj_23)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_16)
       (pred_2 obj_28)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_32)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_19)

       (pred_6  obj_29 obj_14)
       (pred_6  obj_05 obj_01)
       (pred_6  obj_07 obj_24)
       (pred_6  obj_21 obj_24)
       (pred_11 obj_29 obj_27)
       (pred_11 obj_05 obj_31)
       (pred_11 obj_07 obj_04)
       (pred_11 obj_21 obj_08)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_11 obj_07 obj_30)
       (pred_11 obj_21 obj_18)
    ))
(:constraints
  (always (not (pred_3 obj_02)))
)
)

; plan
1. (op_2 obj_10 obj_04)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_04)
   goals met: 0 of 2
2. (op_4 obj_04 obj_07)
   deleted: (pred_11 obj_07 obj_04) (pred_4)
   added: (pred_8 obj_07)
   goals met: 0 of 2
3. (op_2 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_03)
   goals met: 0 of 2
4. (op_3 obj_03 obj_07)
   deleted: (pred_8 obj_07)
   added: (pred_4) (pred_11 obj_07 obj_03)
   goals met: 0 of 2
5. (op_2 obj_03 obj_08)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_08)
   goals met: 0 of 2
6. (op_4 obj_08 obj_21)
   deleted: (pred_11 obj_21 obj_08) (pred_4)
   added: (pred_8 obj_21)
   goals met: 0 of 2
7. (op_2 obj_08 obj_03)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_03)
   goals met: 0 of 2
8. (op_2 obj_03 obj_32)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_32)
   goals met: 0 of 2
9. (op_2 obj_32 obj_16)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_16)
   goals met: 0 of 2
10. (op_2 obj_16 obj_18)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_18)
   goals met: 0 of 2
11. (op_3 obj_18 obj_21)
   deleted: (pred_8 obj_21)
   added: (pred_4) (pred_11 obj_21 obj_18)
   goals met: 1 of 2
12. (op_2 obj_18 obj_16)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_16)
   goals met: 1 of 2
13. (op_2 obj_16 obj_32)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_32)
   goals met: 1 of 2
14. (op_2 obj_32 obj_03)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_03)
   goals met: 1 of 2
15. (op_4 obj_03 obj_07)
   deleted: (pred_11 obj_07 obj_03) (pred_4)
   added: (pred_8 obj_07)
   goals met: 1 of 2
16. (op_2 obj_03 obj_32)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_32)
   goals met: 1 of 2
17. (op_2 obj_32 obj_16)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_16)
   goals met: 1 of 2
18. (op_2 obj_16 obj_23)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_23)
   goals met: 1 of 2
19. (op_2 obj_23 obj_11)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_11)
   goals met: 1 of 2
20. (op_2 obj_11 obj_25)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_25)
   goals met: 1 of 2
21. (op_2 obj_25 obj_30)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_30)
   goals met: 1 of 2
22. (op_3 obj_30 obj_07)
   deleted: (pred_8 obj_07)
   added: (pred_4) (pred_11 obj_07 obj_30)
   goals met: 2 of 2
